# IsInside Method (UV) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..IsInside Method (UV)
Face Class See Also
---
Indicates whether the specified point is within this face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsInside(
	UV point
)
```

Visual Basic
---
```text
Public Function IsInside ( _
	point As UV _
) As Boolean
```

Visual C++
---
```text
public:
bool IsInside(
	UV^ point
)
```

# ### Parameters
point
    Type: Autodesk.Revit.DB..::..UVThe parameters to be evaluated, in natural parameterization of the face.
# ### Return Value
True if point is within this face or on its boundary, otherwise false.
# See Also
Face Class
IsInside Overload
Autodesk.Revit.DB Namespace